# PANDAS

KEYNOTE1:Creating pandas array

KEYNOTE2: SERIES

In [38]:
import pandas as pd
obj=pd.Series([2,4,5,6.0])
obj

0    2.0
1    4.0
2    5.0
3    6.0
dtype: float64

In [39]:
obj.values
# list the values and dtype of the obj without stating its index

array([2., 4., 5., 6.])

In [40]:
obj.index.name="val"
# obj
obj.index
# state the index of the values

RangeIndex(start=0, stop=4, step=1, name='val')

In [41]:
obj1=pd.Series([10,20,30,40], index=['1','2','3','4'])
obj1
# creating pandas series array specifying its index

1    10
2    20
3    30
4    40
dtype: int64

In [42]:
obj1[obj1>20]
# list the values in the array which are greater than 20

3    30
4    40
dtype: int64

In [43]:
'2' in obj1
# checks if there is a value with index value 2

True

KEYNOTE3:Pandas data types                                                                                                      
    1. dict

In [44]:
data={'value1':10,'value2':12}
pd.Series(data)

value1    10
value2    12
dtype: int64

Manipulating of array

In [45]:
# rearranging
# indx=['value2','value1','value3']
data1=pd.Series(data,index=['value2','value1','value3'])
data1

value2    12.0
value1    10.0
value3     NaN
dtype: float64

In [46]:
# pd.isnull(data1)
pd.notnull(data1)

value2     True
value1     True
value3    False
dtype: bool

In [47]:
data1.name="myvalues"
data1.index.name="state"
data1
# assigns the name attribute and state to index part

state
value2    12.0
value1    10.0
value3     NaN
Name: myvalues, dtype: float64

KEYNOTE 4:DATAFRAME
    
    Dataframe ordered collection of columns arranged in a table

In [48]:
values={'colmn1':[2019,2018,2017,2016,2015,2014],
       'colmn2':["john","mark","brian","mercy","jael","evelyne"],
       'colmn3':[200,300,400,500,600,700]}
datafr=pd.DataFrame(values)
datafr

   colmn1   colmn2  colmn3
0    2019     john     200
1    2018     mark     300
2    2017    brian     400
3    2016    mercy     500
4    2015     jael     600
5    2014  evelyne     700

In [49]:
# datafr.head()
datafr.tail()
# selects only the first five rows

   colmn1   colmn2  colmn3
1    2018     mark     300
2    2017    brian     400
3    2016    mercy     500
4    2015     jael     600
5    2014  evelyne     700

In [50]:
# rearranging
formated=pd.DataFrame(datafr,columns=['colmn2','colmn1','colmn3'])
formated

    colmn2  colmn1  colmn3
0     john    2019     200
1     mark    2018     300
2    brian    2017     400
3    mercy    2016     500
4     jael    2015     600
5  evelyne    2014     700

In [51]:
values1=pd.DataFrame(datafr,columns=['colmn2','colmn1','colmn3','colmn4'],index=[1,0,2,3,4,5])
values1

    colmn2  colmn1  colmn3  colmn4
1     mark    2018     300     NaN
0     john    2019     200     NaN
2    brian    2017     400     NaN
3    mercy    2016     500     NaN
4     jael    2015     600     NaN
5  evelyne    2014     700     NaN

In [52]:
# retriving a colomn in a dataframe
formated.columns

Index(['colmn2', 'colmn1', 'colmn3'], dtype='object')

In [53]:
formated['colmn2']

0       john
1       mark
2      brian
3      mercy
4       jael
5    evelyne
Name: colmn2, dtype: object

In [54]:
formated.colmn2

0       john
1       mark
2      brian
3      mercy
4       jael
5    evelyne
Name: colmn2, dtype: object

In [55]:
# formated['colmn4']="newvalue"
import numpy as np
formated['colmn4']=np.arange(6.)
formated

    colmn2  colmn1  colmn3  colmn4
0     john    2019     200     0.0
1     mark    2018     300     1.0
2    brian    2017     400     2.0
3    mercy    2016     500     3.0
4     jael    2015     600     4.0
5  evelyne    2014     700     5.0

In [56]:
changedvalue=pd.Series([10.2,20.0,30.5], index=[1,2,3])
formated.colmn4=changedvalue
formated

    colmn2  colmn1  colmn3  colmn4
0     john    2019     200     NaN
1     mark    2018     300    10.2
2    brian    2017     400    20.0
3    mercy    2016     500    30.5
4     jael    2015     600     NaN
5  evelyne    2014     700     NaN

In [57]:
formated['colmn5']=formated.colmn2=='jael'
formated

    colmn2  colmn1  colmn3  colmn4  colmn5
0     john    2019     200     NaN   False
1     mark    2018     300    10.2   False
2    brian    2017     400    20.0   False
3    mercy    2016     500    30.5   False
4     jael    2015     600     NaN    True
5  evelyne    2014     700     NaN   False

In [58]:
del formated['colmn5']

In [59]:
formated

    colmn2  colmn1  colmn3  colmn4
0     john    2019     200     NaN
1     mark    2018     300    10.2
2    brian    2017     400    20.0
3    mercy    2016     500    30.5
4     jael    2015     600     NaN
5  evelyne    2014     700     NaN

In [67]:
csv1=pd.read_csv('C:/Users/Brightstar/Downloads/train_test_hackathon.csv')

In [79]:
csv1.head().isnull()
#displays boolean of values which are null in the  head
csv1.tail()
# displays the values in the tail/bottom part of the csv1 file
csv1.isnull().sum()
# counts the number of null values in each column and then outputs

Unnamed: 0     0
Identifier     0
Time           0
Feature_1      0
Feature_2      0
              ..
Feature_288    0
Feature_289    0
Target_1       0
Target_2       0
Target_3       0
Length: 295, dtype: int64

In [78]:
csv1.columns
# list the column names

Index(['Unnamed: 0', 'Identifier', 'Time', 'Feature_1', 'Feature_2',
       'Feature_3', 'Feature_4', 'Feature_5', 'Feature_6', 'Feature_7',
       ...
       'Feature_283', 'Feature_284', 'Feature_285', 'Feature_286',
       'Feature_287', 'Feature_288', 'Feature_289', 'Target_1', 'Target_2',
       'Target_3'],
      dtype='object', length=295)

In [80]:
csv1.shape
# displys the shape of the csv1

(58955, 295)

In [83]:
csv1.dropna(how="any").shape
# drop a row is any of its value is missing

(58955, 295)

In [84]:
csv1.dropna(how='all').shape
# drops a row if all of its values are null

(58955, 295)

In [ ]:
csv1.dropna(subset['Feature_3','Feature_5'],how='any').shape
# drops a row if either values of Feature_3 or Feature_5 is null

In [85]:
csv1['Unnamed: 0'].value_counts() #counts the appearence of a value in "Unnamed: 0 " column
# by default missing values are excluded

2047     1
21151    1
17053    1
19100    1
29339    1
        ..
48445    1
46396    1
36155    1
34106    1
0        1
Name: Unnamed: 0, Length: 58955, dtype: int64

In [87]:
csv1['Unnamed: 0'].fillna(value=1020,inplace=True)